[
    {
        "id":"1",
        "name":"Street Fighter 6",
        "genre":["Fighting", "Adventure"],
        "developers":"Capcom",
        "description":"Street Fighter 6 offers a highly evolved combat system with three control types - Classic, Modern and Dynamic - allowing you to quickly play to your skill level. The new Real Time Commentary Feature adds all the hype of a competitive match as well as easy-to-understand explanations about your gameplay.",
        "cost":"$54.99",
        "image":"sf6.png"
    },
    {
        "id":"2",
        "name":"Elden Ring",
        "genre":["Adventure", "Fighting", "Souls-like"],
        "developers":"FromSoftware",
        "description":"Elden Ring is a third-person perspective, action, role-playing game with a focus on combat and exploration. It includes elements that are similar to those in other FromSoftware-developed games such as the Dark Souls series, Bloodborne, and Sekiro: Shadows Die Twice.",
        "cost":"$59.99",
        "image":"elden.png"
    },
    {
        "id":"3",
        "name":"Bomb Rush Cyberfunk",
        "genre": ["Platformer", "Adventure", "Indie"],
        "developers":"Team Reptile",
        "description":"Start your own cypher and dance, paint graffiti, collect beats, combo your tricks and face off with the cops to stake your claim to the sprawling metropolis of New Amsterdam. Red is a graffiti writer who lost his head and instead uses a cyberhead to get around.",
        "cost":"$39.99",
        "image":"brcf.png"
    },
    {
        "id":"4",
        "name":"Overwatch 2",
        "genre":["First-person Shooter", "Multiplayer"],
        "developers":"Blizzard",
        "description":"Overwatch 2 is a free-to-play shooter featuring 30+ epic heroes, each with game-changing abilities. Choose your hero, group up with your friends and battle across all-new maps and modes in the ultimate team-based shooter.(WARNING BAD GAME)",
        "cost":"Free",
        "image":"ow2.png"
    },
    {
        "id":"5",
        "name":"Pikmin 4",
        "genre":[ "Puzzle", "Adventure", "Real-time Strategy"],
        "developers":"Nintendo",
        "description":"Pikmin 4 retains Pikmin types from previous games, and introduces two new species: Ice Pikmin, which are invulnerable to being frozen and can freeze enemies and bodies of water; and Glow Pikmin, which operate at night and are usable during the Night Time Expeditions.",
        "cost":"$59.99",
        "image":"pikmen.png"
    },
    {
        "id": "6",
        "name":"Rocket League",
        "genre": ["sports", "racing", "cars"],
        "developers": "Psyonix",
        "description":"Rocket League is a video game the combines arcade-style soccer and driving games. You play by controlling rocket-powered vehicles, which you can use to score goals with a giant soccer ball. Gameplay is energetic and chaotic as the cars can flip and fly in all directions.",
        "cost": "Free",
        "image": "/Rocket_League.png"
    },

    {
        "id": "7",
        "name":"Risk of Rain 2",
        "genre": ["Rouge-Like", "Survival", "Fighting"],
        "developers": "Hopoo Games",
        "description":"Players control a survivor who is stranded on an alien planet. To survive, they navigate through various environments, killing monsters and looting chests to collect items that boost their offensive and defensive capabilities. Over time, the game's difficulty increases, spawning more powerful and dangerous creatures.",
        "cost": "$20",
        "image": "/ROR2.png"
    },

    {
        "id": "8",
        "name":"Stardew Valley",
        "genre": ["Survival", "Farming"],
        "developers": "Concerned Ape",
        "description":"Stardew Valley is open-ended, allowing players to grow crops, raise livestock, fish, cook, mine, forage, and socialize with the townspeople, including the ability to marry and have children. It allows up to four players to play online together. Barone developed Stardew Valley by himself over four and a half years.",
        "cost": "$20",
        "image": "/Stardew_Valley.png"
    },

    {
        "id": "9",
        "name":"Terra Tech",
        "genre": ["Survival", "Building", "Sandbox"],
        "developers": "Payload Studio",
        "description":"TerraTech is an open-world, sandbox adventure game, where you design and build your own creations through a mix of crafting, combat and discovery. Explore, build, craft and battle across alien worlds in a physics-based construction sandbox. Design cars, tanks and planes from a huge library of blocks.",
        "cost": "$20",
        "image": "/Terra_Tech.png"
    },

    {
        "id": "10",
        "name":"Super Smash Bros: Melee",
        "genre": ["Fighting", "Platformer"],
        "developers": "Nintendo",
        "description":"Like its predecessor, Super Smash Bros. Melee is a platform fighter that differs from traditional fighting games as the objective is to force their opponents beyond the boundaries of the stage. Most attacks inflict damage and can, if enough damage is dealt, knock back the enemy.",
        "cost": "$20",
        "image": "/SsbmBoxart.png"
    },

    {
        "id": "11",
        "name":"Pokemon Black",
        "genre": ["Strategy", "Adventure", "Collector"],
        "developers": "Nintendo",
        "description":"In addition to a wealth of new Pokémon for players to catch, train and battle with, Pokémon Black Version also supplies players with entirely new ways to fight with its new Battle Modes: Triple Battles and Rotation Battles",
        "cost": "$59.99",
        "image": "/pblack.png"
    },

    {
        "id": "12",
        "name":"Pokemon White",
        "genre": ["Strategy", "Adventure", "Collector"],
        "developers": "Nintendo",
        "description":"Pokémon White Version features the same handheld RPG and Adventure gameplay that has consistently thrilled Nintendo DS players, both young and more experienced, but it also introduces players to an all-new Unova region.",
        "cost": "$59.99",
        "image": "/pwhite.png"
    },

    {
        "id": "13",
        "name":"Pokemon Emerald Rogue",
        "genre": ["Strategy", "Rouge-Like", "Survival", "Adventure"],
        "developers": "Pokabbie",
        "description":"When you go on an adventure, all routes, encounters, and items are chosen procedurally based on your progress through a run. After a certain number of routes, you will come across a random gym leader with a procedurally selected team of their assigned type; as you progress further into a run, gym leaders and other trainers will begin using more difficult setups for their Pokemon.",
        "cost": "Free",
        "image": "/pemerald.png"
    },

    {
        "id": "14",
        "name":"The legend of Zelda: TOTK",
        "genre": ["Survival", "Adventure", "Fighting", "Puzzle", "Platformer", "Sandbox"],
        "developers": "Nintendo",
        "description":"Tears of the Kingdom takes place a number of years after Breath of the Wild, at the end of the Zelda timeline in the kingdom of Hyrule. Link and Zelda set out to explore a cavern beneath Hyrule Castle, from which gloom, a poisonous substance, has been seeping out and causing people to fall ill.",
        "cost": "$69.99",
        "image": "/totk.png"
    },
     
    {
        "id": "15",
        "name":"Lethal League Blaze",
        "genre": ["Fighting", "sports"],
        "developers": "Team Reptile",
        "description":"Lethal League Blaze is an intense, high speed ball game, with unique characters, outta sight sounds and none of that weak stuff. In Shine City, the anti-gravity ball game has long been illegal. The group who kept playing was dubbed the Lethal League.",
        "cost": "$19.99",
        "image": "/lethal.png"
    },

    {
        "id": "16",
        "name":"Bloons Tower Defense 6",
        "genre": ["Real-time Strategy", "Puzzle", "Survival"],
        "developers": "Ninja Kiwi",
        "description":"Bloons TD 6 currently features a roster of 23 monkeys (3 new monkeys and 20 returning from previous BTD games) and 13 heroes to help pop bloons. These monkeys are split into four classes: Primary, Military, Magic, and Support.",
        "cost": "$6.99",
        "image": "btd6.png"
    },

    {
        "id":"17",
        "name":"Gran Turismo 7",
        "genre":["racing", "Survival", "sports"],
        "developers":"PolyPhony Digital",
        "description":"Gran Turismo 7 brings together the very best features of the Real Driving Simulator. Whether you're a competitive or casual racer, collector, tuner, livery designer or photographer – find your line with a staggering collection of game modes including fan-favorites like GT Campaign, Arcade and Driving School.",
        "cost":"$59.99",
        "image":"grant.png"
    },

    {
        "id":"18",
        "name":"Titanfall2",
        "genre":["First-person Shooter", "Platformer", "Adventure"],
        "developers":"Respawn",
        "description":"Similar to its predecessor, Titanfall 2 is a first-person shooter where players can control both a pilot and their Titans—mecha-style robots that stand roughly seven to ten meters tall. The pilot has a large variety of equipment that enhance their abilities during combat.",
        "cost":"$59.99",
        "image":"titanf.png"
    }
]
